espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_OUT_PUSH_CH0_REG register
 *  Configures the tx fifo of channel 0
 */
#define DMA2D_OUT_PUSH_CH0_REG (DR_REG_DMA2D_BASE + 0x18)
/** DMA2D_OUTFIFO_WDATA_CH0 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define DMA2D_OUTFIFO_WDATA_CH0    0x000003FFU
#define DMA2D_OUTFIFO_WDATA_CH0_M  (DMA2D_OUTFIFO_WDATA_CH0_V << DMA2D_OUTFIFO_WDATA_CH0_S)
#define DMA2D_OUTFIFO_WDATA_CH0_V  0x000003FFU
#define DMA2D_OUTFIFO_WDATA_CH0_S  0
/** DMA2D_OUTFIFO_PUSH_CH0 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define DMA2D_OUTFIFO_PUSH_CH0    (BIT(10))
#define DMA2D_OUTFIFO_PUSH_CH0_M  (DMA2D_OUTFIFO_PUSH_CH0_V << DMA2D_OUTFIFO_PUSH_CH0_S)
#define DMA2D_OUTFIFO_PUSH_CH0_V  0x00000001U
#define DMA2D_OUTFIFO_PUSH_CH0_S  10

/** DMA2D_OUT_LINK_CONF_CH0_REG register
 *  Configures the tx descriptor operations of channel 0
 */
#define DMA2D_OUT_LINK_CONF_CH0_REG (DR_REG_DMA2D_BASE + 0x1c)
/** DMA2D_OUTLINK_STOP_CH0 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define DMA2D_OUTLINK_STOP_CH0    (BIT(20))
#define DMA2D_OUTLINK_STOP_CH0_M  (DMA2D_OUTLINK_STOP_CH0_V << DMA2D_OUTLINK_STOP_CH0_S)
#define DMA2D_OUTLINK_STOP_CH0_V  0x00000001U
#define DMA2D_OUTLINK_STOP_CH0_S  20
/** DMA2D_OUTLINK_START_CH0 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define DMA2D_OUTLINK_START_CH0    (BIT(21))
#define DMA2D_OUTLINK_START_CH0_M  (DMA2D_OUTLINK_START_CH0_V << DMA2D_OUTLINK_START_CH0_S)
#define DMA2D_OUTLINK_START_CH0_V  0x00000001U
#define DMA2D_OUTLINK_START_CH0_S  21
/** DMA2D_OUTLINK_RESTART_CH0 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define DMA2D_OUTLINK_RESTART_CH0    (BIT(22))
#define DMA2D_OUTLINK_RESTART_CH0_M  (DMA2D_OUTLINK_RESTART_CH0_V << DMA2D_OUTLINK_RESTART_CH0_S)
#define DMA2D_OUTLINK_RESTART_CH0_V  0x00000001U
#define DMA2D_OUTLINK_RESTART_CH0_S  22
/** DMA2D_OUTLINK_PARK_CH0 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define DMA2D_OUTLINK_PARK_CH0    (BIT(23))
#define DMA2D_OUTLINK_PARK_CH0_M  (DMA2D_OUTLINK_PARK_CH0_V << DMA2D_OUTLINK_PARK_CH0_S)
#define DMA2D_OUTLINK_PARK_CH0_V  0x00000001U
#define DMA2D_OUTLINK_PARK_CH0_S  23

/** DMA2D_OUT_LINK_ADDR_CH0_REG register
 *  Configures the tx descriptor address of channel 0
 */
#define DMA2D_OUT_LINK_ADDR_CH0_REG (DR_REG_DMA2D_BASE + 0x20)
/** DMA2D_OUTLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define DMA2D_OUTLINK_ADDR_CH0    0xFFFFFFFFU
#define DMA2D_OUTLINK_ADDR_CH0_M  (DMA2D_OUTLINK_ADDR_CH0_V << DMA2D_OUTLINK_ADDR_CH0_S)
#define DMA2D_OUTLINK_ADDR_CH0_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_ADDR_CH0_S  0

/** DMA2D_OUT_STATE_CH0_REG register
 *  Represents the working status of the tx descriptor of channel 0
 */
#define DMA2D_OUT_STATE_CH0_REG (DR_REG_DMA2D_BASE + 0x24)
/** DMA2D_OUTLINK_DSCR_ADDR_CH0 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define DMA2D_OUTLINK_DSCR_ADDR_CH0    0x0003FFFFU
#define DMA2D_OUTLINK_DSCR_ADDR_CH0_M  (DMA2D_OUTLINK_DSCR_ADDR_CH0_V << DMA2D_OUTLINK_DSCR_ADDR_CH0_S)
#define DMA2D_OUTLINK_DSCR_ADDR_CH0_V  0x0003FFFFU
#define DMA2D_OUTLINK_DSCR_ADDR_CH0_S  0
/** DMA2D_OUT_DSCR_STATE_CH0 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define DMA2D_OUT_DSCR_STATE_CH0    0x00000003U
#define DMA2D_OUT_DSCR_STATE_CH0_M  (DMA2D_OUT_DSCR_STATE_CH0_V << DMA2D_OUT_DSCR_STATE_CH0_S)
#define DMA2D_OUT_DSCR_STATE_CH0_V  0x00000003U
#define DMA2D_OUT_DSCR_STATE_CH0_S  18
/** DMA2D_OUT_STATE_CH0 : RO; bitpos: [23:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define DMA2D_OUT_STATE_CH0    0x0000000FU
#define DMA2D_OUT_STATE_CH0_M  (DMA2D_OUT_STATE_CH0_V << DMA2D_OUT_STATE_CH0_S)
#define DMA2D_OUT_STATE_CH0_V  0x0000000FU
#define DMA2D_OUT_STATE_CH0_S  20
/** DMA2D_OUT_RESET_AVAIL_CH0 : RO; bitpos: [24]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define DMA2D_OUT_RESET_AVAIL_CH0    (BIT(24))
#define DMA2D_OUT_RESET_AVAIL_CH0_M  (DMA2D_OUT_RESET_AVAIL_CH0_V << DMA2D_OUT_RESET_AVAIL_CH0_S)
#define DMA2D_OUT_RESET_AVAIL_CH0_V  0x00000001U
#define DMA2D_OUT_RESET_AVAIL_CH0_S  24

/** DMA2D_OUT_EOF_DES_ADDR_CH0_REG register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
#define DMA2D_OUT_EOF_DES_ADDR_CH0_REG (DR_REG_DMA2D_BASE + 0x28)
/** DMA2D_OUT_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define DMA2D_OUT_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define DMA2D_OUT_EOF_DES_ADDR_CH0_M  (DMA2D_OUT_EOF_DES_ADDR_CH0_V << DMA2D_OUT_EOF_DES_ADDR_CH0_S)
#define DMA2D_OUT_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define DMA2D_OUT_EOF_DES_ADDR_CH0_S  0

/** DMA2D_OUT_DSCR_CH0_REG register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
#define DMA2D_OUT_DSCR_CH0_REG (DR_REG_DMA2D_BASE + 0x2c)
/** DMA2D_OUTLINK_DSCR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next outlink descriptor address y.
 */
#define DMA2D_OUTLINK_DSCR_CH0    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_CH0_M  (DMA2D_OUTLINK_DSCR_CH0_V << DMA2D_OUTLINK_DSCR_CH0_S)
#define DMA2D_OUTLINK_DSCR_CH0_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_CH0_S  0

/** DMA2D_OUT_DSCR_BF0_CH0_REG register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
#define DMA2D_OUT_DSCR_BF0_CH0_REG (DR_REG_DMA2D_BASE + 0x30)
/** DMA2D_OUTLINK_DSCR_BF0_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor's next address y-1.
 */
#define DMA2D_OUTLINK_DSCR_BF0_CH0    0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF0_CH0_M  (DMA2D_OUTLINK_DSCR_BF0_CH0_V << DMA2D_OUTLINK_DSCR_BF0_CH0_S)
#define DMA2D_OUTLINK_DSCR_BF0_CH0_V  0xFFFFFFFFU
#define DMA2D_OUTLINK_DSCR_BF0_CH0_S  0

