espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_OUT_INT_RAW_CH2_REG register
 *  Raw interrupt status of TX channel 0
 */
#define DMA2D_OUT_INT_RAW_CH2_REG (DR_REG_DMA2D_BASE + 0x204)
/** DMA2D_OUT_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel 0.
 */
#define DMA2D_OUT_DONE_CH2_INT_RAW    (BIT(0))
#define DMA2D_OUT_DONE_CH2_INT_RAW_M  (DMA2D_OUT_DONE_CH2_INT_RAW_V << DMA2D_OUT_DONE_CH2_INT_RAW_S)
#define DMA2D_OUT_DONE_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUT_DONE_CH2_INT_RAW_S  0
/** DMA2D_OUT_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel 0.
 */
#define DMA2D_OUT_EOF_CH2_INT_RAW    (BIT(1))
#define DMA2D_OUT_EOF_CH2_INT_RAW_M  (DMA2D_OUT_EOF_CH2_INT_RAW_V << DMA2D_OUT_EOF_CH2_INT_RAW_S)
#define DMA2D_OUT_EOF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUT_EOF_CH2_INT_RAW_S  1
/** DMA2D_OUT_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
 *  including owner error, the second and third word error of outlink descriptor for Tx
 *  channel 0.
 */
#define DMA2D_OUT_DSCR_ERR_CH2_INT_RAW    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH2_INT_RAW_M  (DMA2D_OUT_DSCR_ERR_CH2_INT_RAW_V << DMA2D_OUT_DSCR_ERR_CH2_INT_RAW_S)
#define DMA2D_OUT_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH2_INT_RAW_S  2
/** DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel 0.
 */
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW_M  (DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW_V << DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW_S)
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_RAW_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW_M  (DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW_V << DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_RAW_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW_M  (DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW_V << DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_RAW_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW_M  (DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW_V << DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_RAW_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW_M  (DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW_V << DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_RAW_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW_M  (DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW_V << DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_RAW_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW_M  (DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW_V << DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_RAW_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is overflow.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW_M  (DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW_V << DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_RAW_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is underflow.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW_M  (DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW_V << DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW_S)
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_RAW_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW_M  (DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW_V << DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_RAW_S  12

/** DMA2D_OUT_INT_ENA_CH2_REG register
 *  Interrupt enable bits of TX channel 0
 */
#define DMA2D_OUT_INT_ENA_CH2_REG (DR_REG_DMA2D_BASE + 0x208)
/** DMA2D_OUT_DONE_CH2_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define DMA2D_OUT_DONE_CH2_INT_ENA    (BIT(0))
#define DMA2D_OUT_DONE_CH2_INT_ENA_M  (DMA2D_OUT_DONE_CH2_INT_ENA_V << DMA2D_OUT_DONE_CH2_INT_ENA_S)
#define DMA2D_OUT_DONE_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUT_DONE_CH2_INT_ENA_S  0
/** DMA2D_OUT_EOF_CH2_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_EOF_CH2_INT_ENA    (BIT(1))
#define DMA2D_OUT_EOF_CH2_INT_ENA_M  (DMA2D_OUT_EOF_CH2_INT_ENA_V << DMA2D_OUT_EOF_CH2_INT_ENA_S)
#define DMA2D_OUT_EOF_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUT_EOF_CH2_INT_ENA_S  1
/** DMA2D_OUT_DSCR_ERR_CH2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ENA    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ENA_M  (DMA2D_OUT_DSCR_ERR_CH2_INT_ENA_V << DMA2D_OUT_DSCR_ERR_CH2_INT_ENA_S)
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ENA_S  2
/** DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA_M  (DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA_V << DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA_S)
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ENA_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA_M  (DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA_V << DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ENA_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA_M  (DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA_V << DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ENA_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA_M  (DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA_V << DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ENA_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA_M  (DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA_V << DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ENA_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA_M  (DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA_V << DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ENA_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA_M  (DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA_V << DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ENA_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA_M  (DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA_V << DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ENA_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA_M  (DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA_V << DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA_S)
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ENA_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA_M  (DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA_V << DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ENA_S  12

/** DMA2D_OUT_INT_ST_CH2_REG register
 *  Masked interrupt status of TX channel 0
 */
#define DMA2D_OUT_INT_ST_CH2_REG (DR_REG_DMA2D_BASE + 0x20c)
/** DMA2D_OUT_DONE_CH2_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define DMA2D_OUT_DONE_CH2_INT_ST    (BIT(0))
#define DMA2D_OUT_DONE_CH2_INT_ST_M  (DMA2D_OUT_DONE_CH2_INT_ST_V << DMA2D_OUT_DONE_CH2_INT_ST_S)
#define DMA2D_OUT_DONE_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUT_DONE_CH2_INT_ST_S  0
/** DMA2D_OUT_EOF_CH2_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_EOF_CH2_INT_ST    (BIT(1))
#define DMA2D_OUT_EOF_CH2_INT_ST_M  (DMA2D_OUT_EOF_CH2_INT_ST_V << DMA2D_OUT_EOF_CH2_INT_ST_S)
#define DMA2D_OUT_EOF_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUT_EOF_CH2_INT_ST_S  1
/** DMA2D_OUT_DSCR_ERR_CH2_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ST    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ST_M  (DMA2D_OUT_DSCR_ERR_CH2_INT_ST_V << DMA2D_OUT_DSCR_ERR_CH2_INT_ST_S)
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH2_INT_ST_S  2
/** DMA2D_OUT_TOTAL_EOF_CH2_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ST    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ST_M  (DMA2D_OUT_TOTAL_EOF_CH2_INT_ST_V << DMA2D_OUT_TOTAL_EOF_CH2_INT_ST_S)
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_ST_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST_M  (DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST_V << DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_ST_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST_M  (DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST_V << DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_ST_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST_M  (DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST_V << DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_ST_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST_M  (DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST_V << DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_ST_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST_M  (DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST_V << DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_ST_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST_M  (DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST_V << DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_ST_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST_M  (DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST_V << DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_ST_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST : RO; bitpos: [11]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST_M  (DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST_V << DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST_S)
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_ST_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST : RO; bitpos: [12]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST_M  (DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST_V << DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_ST_S  12

/** DMA2D_OUT_INT_CLR_CH2_REG register
 *  Interrupt clear bits of TX channel 0
 */
#define DMA2D_OUT_INT_CLR_CH2_REG (DR_REG_DMA2D_BASE + 0x210)
/** DMA2D_OUT_DONE_CH2_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define DMA2D_OUT_DONE_CH2_INT_CLR    (BIT(0))
#define DMA2D_OUT_DONE_CH2_INT_CLR_M  (DMA2D_OUT_DONE_CH2_INT_CLR_V << DMA2D_OUT_DONE_CH2_INT_CLR_S)
#define DMA2D_OUT_DONE_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUT_DONE_CH2_INT_CLR_S  0
/** DMA2D_OUT_EOF_CH2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_EOF_CH2_INT_CLR    (BIT(1))
#define DMA2D_OUT_EOF_CH2_INT_CLR_M  (DMA2D_OUT_EOF_CH2_INT_CLR_V << DMA2D_OUT_EOF_CH2_INT_CLR_S)
#define DMA2D_OUT_EOF_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUT_EOF_CH2_INT_CLR_S  1
/** DMA2D_OUT_DSCR_ERR_CH2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_ERR_CH2_INT_CLR    (BIT(2))
#define DMA2D_OUT_DSCR_ERR_CH2_INT_CLR_M  (DMA2D_OUT_DSCR_ERR_CH2_INT_CLR_V << DMA2D_OUT_DSCR_ERR_CH2_INT_CLR_S)
#define DMA2D_OUT_DSCR_ERR_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUT_DSCR_ERR_CH2_INT_CLR_S  2
/** DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR    (BIT(3))
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR_M  (DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR_V << DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR_S)
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUT_TOTAL_EOF_CH2_INT_CLR_S  3
/** DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR    (BIT(4))
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR_M  (DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR_V << DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L1_CH2_INT_CLR_S  4
/** DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR    (BIT(5))
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR_M  (DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR_V << DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L1_CH2_INT_CLR_S  5
/** DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR    (BIT(6))
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR_M  (DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR_V << DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L2_CH2_INT_CLR_S  6
/** DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR    (BIT(7))
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR_M  (DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR_V << DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L2_CH2_INT_CLR_S  7
/** DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR    (BIT(8))
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR_M  (DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR_V << DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_OVF_L3_CH2_INT_CLR_S  8
/** DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR    (BIT(9))
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR_M  (DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR_V << DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_UDF_L3_CH2_INT_CLR_S  9
/** DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the OUTFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR    (BIT(10))
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR_M  (DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR_V << DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_RO_OVF_CH2_INT_CLR_S  10
/** DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear the OUTFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR    (BIT(11))
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR_M  (DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR_V << DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR_S)
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUTFIFO_RO_UDF_CH2_INT_CLR_S  11
/** DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR    (BIT(12))
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR_M  (DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR_V << DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR_S)
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR_V  0x00000001U
#define DMA2D_OUT_DSCR_TASK_OVF_CH2_INT_CLR_S  12

