espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_OUTFIFO_STATUS_CH2_REG register
 *  Represents the status of the tx fifo of channel 0
 */
#define DMA2D_OUTFIFO_STATUS_CH2_REG (DR_REG_DMA2D_BASE + 0x214)
/** DMA2D_OUTFIFO_FULL_L2_CH2 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_FULL_L2_CH2    (BIT(0))
#define DMA2D_OUTFIFO_FULL_L2_CH2_M  (DMA2D_OUTFIFO_FULL_L2_CH2_V << DMA2D_OUTFIFO_FULL_L2_CH2_S)
#define DMA2D_OUTFIFO_FULL_L2_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_FULL_L2_CH2_S  0
/** DMA2D_OUTFIFO_EMPTY_L2_CH2 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_EMPTY_L2_CH2    (BIT(1))
#define DMA2D_OUTFIFO_EMPTY_L2_CH2_M  (DMA2D_OUTFIFO_EMPTY_L2_CH2_V << DMA2D_OUTFIFO_EMPTY_L2_CH2_S)
#define DMA2D_OUTFIFO_EMPTY_L2_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_EMPTY_L2_CH2_S  1
/** DMA2D_OUTFIFO_CNT_L2_CH2 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_OUTFIFO_CNT_L2_CH2    0x0000000FU
#define DMA2D_OUTFIFO_CNT_L2_CH2_M  (DMA2D_OUTFIFO_CNT_L2_CH2_V << DMA2D_OUTFIFO_CNT_L2_CH2_S)
#define DMA2D_OUTFIFO_CNT_L2_CH2_V  0x0000000FU
#define DMA2D_OUTFIFO_CNT_L2_CH2_S  2
/** DMA2D_OUT_REMAIN_UNDER_1B_CH2 : RO; bitpos: [7]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_1B_CH2    (BIT(7))
#define DMA2D_OUT_REMAIN_UNDER_1B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_1B_CH2_V << DMA2D_OUT_REMAIN_UNDER_1B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_1B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_1B_CH2_S  7
/** DMA2D_OUT_REMAIN_UNDER_2B_CH2 : RO; bitpos: [8]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_2B_CH2    (BIT(8))
#define DMA2D_OUT_REMAIN_UNDER_2B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_2B_CH2_V << DMA2D_OUT_REMAIN_UNDER_2B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_2B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_2B_CH2_S  8
/** DMA2D_OUT_REMAIN_UNDER_3B_CH2 : RO; bitpos: [9]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_3B_CH2    (BIT(9))
#define DMA2D_OUT_REMAIN_UNDER_3B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_3B_CH2_V << DMA2D_OUT_REMAIN_UNDER_3B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_3B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_3B_CH2_S  9
/** DMA2D_OUT_REMAIN_UNDER_4B_CH2 : RO; bitpos: [10]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_4B_CH2    (BIT(10))
#define DMA2D_OUT_REMAIN_UNDER_4B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_4B_CH2_V << DMA2D_OUT_REMAIN_UNDER_4B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_4B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_4B_CH2_S  10
/** DMA2D_OUT_REMAIN_UNDER_5B_CH2 : RO; bitpos: [11]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_5B_CH2    (BIT(11))
#define DMA2D_OUT_REMAIN_UNDER_5B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_5B_CH2_V << DMA2D_OUT_REMAIN_UNDER_5B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_5B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_5B_CH2_S  11
/** DMA2D_OUT_REMAIN_UNDER_6B_CH2 : RO; bitpos: [12]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_6B_CH2    (BIT(12))
#define DMA2D_OUT_REMAIN_UNDER_6B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_6B_CH2_V << DMA2D_OUT_REMAIN_UNDER_6B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_6B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_6B_CH2_S  12
/** DMA2D_OUT_REMAIN_UNDER_7B_CH2 : RO; bitpos: [13]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_7B_CH2    (BIT(13))
#define DMA2D_OUT_REMAIN_UNDER_7B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_7B_CH2_V << DMA2D_OUT_REMAIN_UNDER_7B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_7B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_7B_CH2_S  13
/** DMA2D_OUT_REMAIN_UNDER_8B_CH2 : RO; bitpos: [14]; default: 1;
 *  reserved
 */
#define DMA2D_OUT_REMAIN_UNDER_8B_CH2    (BIT(14))
#define DMA2D_OUT_REMAIN_UNDER_8B_CH2_M  (DMA2D_OUT_REMAIN_UNDER_8B_CH2_V << DMA2D_OUT_REMAIN_UNDER_8B_CH2_S)
#define DMA2D_OUT_REMAIN_UNDER_8B_CH2_V  0x00000001U
#define DMA2D_OUT_REMAIN_UNDER_8B_CH2_S  14
/** DMA2D_OUTFIFO_FULL_L1_CH2 : RO; bitpos: [15]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_FULL_L1_CH2    (BIT(15))
#define DMA2D_OUTFIFO_FULL_L1_CH2_M  (DMA2D_OUTFIFO_FULL_L1_CH2_V << DMA2D_OUTFIFO_FULL_L1_CH2_S)
#define DMA2D_OUTFIFO_FULL_L1_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_FULL_L1_CH2_S  15
/** DMA2D_OUTFIFO_EMPTY_L1_CH2 : RO; bitpos: [16]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_EMPTY_L1_CH2    (BIT(16))
#define DMA2D_OUTFIFO_EMPTY_L1_CH2_M  (DMA2D_OUTFIFO_EMPTY_L1_CH2_V << DMA2D_OUTFIFO_EMPTY_L1_CH2_S)
#define DMA2D_OUTFIFO_EMPTY_L1_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_EMPTY_L1_CH2_S  16
/** DMA2D_OUTFIFO_CNT_L1_CH2 : RO; bitpos: [21:17]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_OUTFIFO_CNT_L1_CH2    0x0000001FU
#define DMA2D_OUTFIFO_CNT_L1_CH2_M  (DMA2D_OUTFIFO_CNT_L1_CH2_V << DMA2D_OUTFIFO_CNT_L1_CH2_S)
#define DMA2D_OUTFIFO_CNT_L1_CH2_V  0x0000001FU
#define DMA2D_OUTFIFO_CNT_L1_CH2_S  17
/** DMA2D_OUTFIFO_FULL_L3_CH2 : RO; bitpos: [22]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_FULL_L3_CH2    (BIT(22))
#define DMA2D_OUTFIFO_FULL_L3_CH2_M  (DMA2D_OUTFIFO_FULL_L3_CH2_V << DMA2D_OUTFIFO_FULL_L3_CH2_S)
#define DMA2D_OUTFIFO_FULL_L3_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_FULL_L3_CH2_S  22
/** DMA2D_OUTFIFO_EMPTY_L3_CH2 : RO; bitpos: [23]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_OUTFIFO_EMPTY_L3_CH2    (BIT(23))
#define DMA2D_OUTFIFO_EMPTY_L3_CH2_M  (DMA2D_OUTFIFO_EMPTY_L3_CH2_V << DMA2D_OUTFIFO_EMPTY_L3_CH2_S)
#define DMA2D_OUTFIFO_EMPTY_L3_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_EMPTY_L3_CH2_S  23
/** DMA2D_OUTFIFO_CNT_L3_CH2 : RO; bitpos: [28:24]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_OUTFIFO_CNT_L3_CH2    0x0000001FU
#define DMA2D_OUTFIFO_CNT_L3_CH2_M  (DMA2D_OUTFIFO_CNT_L3_CH2_V << DMA2D_OUTFIFO_CNT_L3_CH2_S)
#define DMA2D_OUTFIFO_CNT_L3_CH2_V  0x0000001FU
#define DMA2D_OUTFIFO_CNT_L3_CH2_S  24

/** DMA2D_OUT_PUSH_CH2_REG register
 *  Configures the tx fifo of channel 0
 */
#define DMA2D_OUT_PUSH_CH2_REG (DR_REG_DMA2D_BASE + 0x218)
/** DMA2D_OUTFIFO_WDATA_CH2 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define DMA2D_OUTFIFO_WDATA_CH2    0x000003FFU
#define DMA2D_OUTFIFO_WDATA_CH2_M  (DMA2D_OUTFIFO_WDATA_CH2_V << DMA2D_OUTFIFO_WDATA_CH2_S)
#define DMA2D_OUTFIFO_WDATA_CH2_V  0x000003FFU
#define DMA2D_OUTFIFO_WDATA_CH2_S  0
/** DMA2D_OUTFIFO_PUSH_CH2 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define DMA2D_OUTFIFO_PUSH_CH2    (BIT(10))
#define DMA2D_OUTFIFO_PUSH_CH2_M  (DMA2D_OUTFIFO_PUSH_CH2_V << DMA2D_OUTFIFO_PUSH_CH2_S)
#define DMA2D_OUTFIFO_PUSH_CH2_V  0x00000001U
#define DMA2D_OUTFIFO_PUSH_CH2_S  10

