espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_OUT_SCRAMBLE_CH2_REG register
 *  Configures the tx scramble of channel 0
 */
#define DMA2D_OUT_SCRAMBLE_CH2_REG (DR_REG_DMA2D_BASE + 0x24c)
/** DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2    0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_M  (DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_V << DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_S)
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_V  0x00000007U
#define DMA2D_OUT_SCRAMBLE_SEL_PRE_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM0_CH2_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM0_CH2_REG (DR_REG_DMA2D_BASE + 0x250)
/** DMA2D_OUT_COLOR_PARAM_H0_CH2 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H0_CH2    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH2_M  (DMA2D_OUT_COLOR_PARAM_H0_CH2_V << DMA2D_OUT_COLOR_PARAM_H0_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_H0_CH2_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_H0_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM1_CH2_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM1_CH2_REG (DR_REG_DMA2D_BASE + 0x254)
/** DMA2D_OUT_COLOR_PARAM_H1_CH2 : R/W; bitpos: [27:0]; default: 210164121;
 *  Set last 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_H1_CH2    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_H1_CH2_M  (DMA2D_OUT_COLOR_PARAM_H1_CH2_V << DMA2D_OUT_COLOR_PARAM_H1_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_H1_CH2_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_H1_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM2_CH2_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM2_CH2_REG (DR_REG_DMA2D_BASE + 0x258)
/** DMA2D_OUT_COLOR_PARAM_M0_CH2 : R/W; bitpos: [20:0]; default: 1995050;
 *  Set first 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_M0_CH2    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_M0_CH2_M  (DMA2D_OUT_COLOR_PARAM_M0_CH2_V << DMA2D_OUT_COLOR_PARAM_M0_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_M0_CH2_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_M0_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM3_CH2_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM3_CH2_REG (DR_REG_DMA2D_BASE + 0x25c)
/** DMA2D_OUT_COLOR_PARAM_M1_CH2 : R/W; bitpos: [27:0]; default: 35540784;
 *  Set last 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_M1_CH2    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_M1_CH2_M  (DMA2D_OUT_COLOR_PARAM_M1_CH2_V << DMA2D_OUT_COLOR_PARAM_M1_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_M1_CH2_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_M1_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM4_CH2_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM4_CH2_REG (DR_REG_DMA2D_BASE + 0x260)
/** DMA2D_OUT_COLOR_PARAM_L0_CH2 : R/W; bitpos: [20:0]; default: 528682;
 *  Set first 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_L0_CH2    0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_L0_CH2_M  (DMA2D_OUT_COLOR_PARAM_L0_CH2_V << DMA2D_OUT_COLOR_PARAM_L0_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_L0_CH2_V  0x001FFFFFU
#define DMA2D_OUT_COLOR_PARAM_L0_CH2_S  0

/** DMA2D_OUT_COLOR_PARAM5_CH2_REG register
 *  Configures the tx color convert parameter of channel 0
 */
#define DMA2D_OUT_COLOR_PARAM5_CH2_REG (DR_REG_DMA2D_BASE + 0x264)
/** DMA2D_OUT_COLOR_PARAM_L1_CH2 : R/W; bitpos: [27:0]; default: 195899392;
 *  Set last 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_OUT_COLOR_PARAM_L1_CH2    0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_L1_CH2_M  (DMA2D_OUT_COLOR_PARAM_L1_CH2_V << DMA2D_OUT_COLOR_PARAM_L1_CH2_S)
#define DMA2D_OUT_COLOR_PARAM_L1_CH2_V  0x0FFFFFFFU
#define DMA2D_OUT_COLOR_PARAM_L1_CH2_S  0

/** DMA2D_OUT_ETM_CONF_CH2_REG register
 *  Configures the tx etm of channel 0
 */
#define DMA2D_OUT_ETM_CONF_CH2_REG (DR_REG_DMA2D_BASE + 0x268)
/** DMA2D_OUT_ETM_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_OUT_ETM_EN_CH2    (BIT(0))
#define DMA2D_OUT_ETM_EN_CH2_M  (DMA2D_OUT_ETM_EN_CH2_V << DMA2D_OUT_ETM_EN_CH2_S)
#define DMA2D_OUT_ETM_EN_CH2_V  0x00000001U
#define DMA2D_OUT_ETM_EN_CH2_S  0
/** DMA2D_OUT_ETM_LOOP_EN_CH2 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_OUT_ETM_LOOP_EN_CH2    (BIT(1))
#define DMA2D_OUT_ETM_LOOP_EN_CH2_M  (DMA2D_OUT_ETM_LOOP_EN_CH2_V << DMA2D_OUT_ETM_LOOP_EN_CH2_S)
#define DMA2D_OUT_ETM_LOOP_EN_CH2_V  0x00000001U
#define DMA2D_OUT_ETM_LOOP_EN_CH2_S  1
/** DMA2D_OUT_DSCR_TASK_MAK_CH2 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_OUT_DSCR_TASK_MAK_CH2    0x00000003U
#define DMA2D_OUT_DSCR_TASK_MAK_CH2_M  (DMA2D_OUT_DSCR_TASK_MAK_CH2_V << DMA2D_OUT_DSCR_TASK_MAK_CH2_S)
#define DMA2D_OUT_DSCR_TASK_MAK_CH2_V  0x00000003U
#define DMA2D_OUT_DSCR_TASK_MAK_CH2_S  2

/** DMA2D_OUT_DSCR_PORT_BLK_CH2_REG register
 *  Configures the tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_CH2_REG (DR_REG_DMA2D_BASE + 0x26c)
/** DMA2D_OUT_DSCR_PORT_BLK_H_CH2 : R/W; bitpos: [13:0]; default: 18;
 *  Set the horizontal width of tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2    0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2_M  (DMA2D_OUT_DSCR_PORT_BLK_H_CH2_V << DMA2D_OUT_DSCR_PORT_BLK_H_CH2_S)
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2_V  0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_H_CH2_S  0
/** DMA2D_OUT_DSCR_PORT_BLK_V_CH2 : R/W; bitpos: [27:14]; default: 18;
 *  Set the vertical height of tx block size in dscr port mode
 */
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2    0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2_M  (DMA2D_OUT_DSCR_PORT_BLK_V_CH2_V << DMA2D_OUT_DSCR_PORT_BLK_V_CH2_S)
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2_V  0x00003FFFU
#define DMA2D_OUT_DSCR_PORT_BLK_V_CH2_S  14

