espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_IN_INT_CLR_CH0_REG register
 *  Interrupt clear bits of RX channel 0
 */
#define DMA2D_IN_INT_CLR_CH0_REG (DR_REG_DMA2D_BASE + 0x510)
/** DMA2D_IN_DONE_CH0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define DMA2D_IN_DONE_CH0_INT_CLR    (BIT(0))
#define DMA2D_IN_DONE_CH0_INT_CLR_M  (DMA2D_IN_DONE_CH0_INT_CLR_V << DMA2D_IN_DONE_CH0_INT_CLR_S)
#define DMA2D_IN_DONE_CH0_INT_CLR_V  0x00000001U
#define DMA2D_IN_DONE_CH0_INT_CLR_S  0
/** DMA2D_IN_SUC_EOF_CH0_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_SUC_EOF_CH0_INT_CLR    (BIT(1))
#define DMA2D_IN_SUC_EOF_CH0_INT_CLR_M  (DMA2D_IN_SUC_EOF_CH0_INT_CLR_V << DMA2D_IN_SUC_EOF_CH0_INT_CLR_S)
#define DMA2D_IN_SUC_EOF_CH0_INT_CLR_V  0x00000001U
#define DMA2D_IN_SUC_EOF_CH0_INT_CLR_S  1
/** DMA2D_IN_ERR_EOF_CH0_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define DMA2D_IN_ERR_EOF_CH0_INT_CLR    (BIT(2))
#define DMA2D_IN_ERR_EOF_CH0_INT_CLR_M  (DMA2D_IN_ERR_EOF_CH0_INT_CLR_V << DMA2D_IN_ERR_EOF_CH0_INT_CLR_S)
#define DMA2D_IN_ERR_EOF_CH0_INT_CLR_V  0x00000001U
#define DMA2D_IN_ERR_EOF_CH0_INT_CLR_S  2
/** DMA2D_IN_DSCR_ERR_CH0_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_ERR_CH0_INT_CLR    (BIT(3))
#define DMA2D_IN_DSCR_ERR_CH0_INT_CLR_M  (DMA2D_IN_DSCR_ERR_CH0_INT_CLR_V << DMA2D_IN_DSCR_ERR_CH0_INT_CLR_S)
#define DMA2D_IN_DSCR_ERR_CH0_INT_CLR_V  0x00000001U
#define DMA2D_IN_DSCR_ERR_CH0_INT_CLR_S  3
/** DMA2D_INFIFO_OVF_L1_CH0_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L1_CH0_INT_CLR    (BIT(4))
#define DMA2D_INFIFO_OVF_L1_CH0_INT_CLR_M  (DMA2D_INFIFO_OVF_L1_CH0_INT_CLR_V << DMA2D_INFIFO_OVF_L1_CH0_INT_CLR_S)
#define DMA2D_INFIFO_OVF_L1_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_OVF_L1_CH0_INT_CLR_S  4
/** DMA2D_INFIFO_UDF_L1_CH0_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L1_CH0_INT_CLR    (BIT(5))
#define DMA2D_INFIFO_UDF_L1_CH0_INT_CLR_M  (DMA2D_INFIFO_UDF_L1_CH0_INT_CLR_V << DMA2D_INFIFO_UDF_L1_CH0_INT_CLR_S)
#define DMA2D_INFIFO_UDF_L1_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_UDF_L1_CH0_INT_CLR_S  5
/** DMA2D_INFIFO_OVF_L2_CH0_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L2_CH0_INT_CLR    (BIT(6))
#define DMA2D_INFIFO_OVF_L2_CH0_INT_CLR_M  (DMA2D_INFIFO_OVF_L2_CH0_INT_CLR_V << DMA2D_INFIFO_OVF_L2_CH0_INT_CLR_S)
#define DMA2D_INFIFO_OVF_L2_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_OVF_L2_CH0_INT_CLR_S  6
/** DMA2D_INFIFO_UDF_L2_CH0_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L2_CH0_INT_CLR    (BIT(7))
#define DMA2D_INFIFO_UDF_L2_CH0_INT_CLR_M  (DMA2D_INFIFO_UDF_L2_CH0_INT_CLR_V << DMA2D_INFIFO_UDF_L2_CH0_INT_CLR_S)
#define DMA2D_INFIFO_UDF_L2_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_UDF_L2_CH0_INT_CLR_S  7
/** DMA2D_INFIFO_OVF_L3_CH0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_OVF_L3_CH0_INT_CLR    (BIT(8))
#define DMA2D_INFIFO_OVF_L3_CH0_INT_CLR_M  (DMA2D_INFIFO_OVF_L3_CH0_INT_CLR_V << DMA2D_INFIFO_OVF_L3_CH0_INT_CLR_S)
#define DMA2D_INFIFO_OVF_L3_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_OVF_L3_CH0_INT_CLR_S  8
/** DMA2D_INFIFO_UDF_L3_CH0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define DMA2D_INFIFO_UDF_L3_CH0_INT_CLR    (BIT(9))
#define DMA2D_INFIFO_UDF_L3_CH0_INT_CLR_M  (DMA2D_INFIFO_UDF_L3_CH0_INT_CLR_V << DMA2D_INFIFO_UDF_L3_CH0_INT_CLR_S)
#define DMA2D_INFIFO_UDF_L3_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_UDF_L3_CH0_INT_CLR_S  9
/** DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR    (BIT(10))
#define DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR_M  (DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR_V << DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR_S)
#define DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR_V  0x00000001U
#define DMA2D_IN_DSCR_EMPTY_CH0_INT_CLR_S  10
/** DMA2D_INFIFO_RO_OVF_CH0_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear the INFIFO_RO_OVF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_OVF_CH0_INT_CLR    (BIT(11))
#define DMA2D_INFIFO_RO_OVF_CH0_INT_CLR_M  (DMA2D_INFIFO_RO_OVF_CH0_INT_CLR_V << DMA2D_INFIFO_RO_OVF_CH0_INT_CLR_S)
#define DMA2D_INFIFO_RO_OVF_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_RO_OVF_CH0_INT_CLR_S  11
/** DMA2D_INFIFO_RO_UDF_CH0_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear the INFIFO_RO_UDF_CH_INT interrupt.
 */
#define DMA2D_INFIFO_RO_UDF_CH0_INT_CLR    (BIT(12))
#define DMA2D_INFIFO_RO_UDF_CH0_INT_CLR_M  (DMA2D_INFIFO_RO_UDF_CH0_INT_CLR_V << DMA2D_INFIFO_RO_UDF_CH0_INT_CLR_S)
#define DMA2D_INFIFO_RO_UDF_CH0_INT_CLR_V  0x00000001U
#define DMA2D_INFIFO_RO_UDF_CH0_INT_CLR_S  12
/** DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR : WT; bitpos: [13]; default: 0;
 *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR    (BIT(13))
#define DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR_M  (DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR_V << DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR_S)
#define DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR_V  0x00000001U
#define DMA2D_IN_DSCR_TASK_OVF_CH0_INT_CLR_S  13

/** DMA2D_INFIFO_STATUS_CH0_REG register
 *  Represents the status of the rx fifo of channel 0
 */
#define DMA2D_INFIFO_STATUS_CH0_REG (DR_REG_DMA2D_BASE + 0x514)
/** DMA2D_INFIFO_FULL_L2_CH0 : RO; bitpos: [0]; default: 0;
 *  Rx FIFO full signal for Rx channel.
 */
#define DMA2D_INFIFO_FULL_L2_CH0    (BIT(0))
#define DMA2D_INFIFO_FULL_L2_CH0_M  (DMA2D_INFIFO_FULL_L2_CH0_V << DMA2D_INFIFO_FULL_L2_CH0_S)
#define DMA2D_INFIFO_FULL_L2_CH0_V  0x00000001U
#define DMA2D_INFIFO_FULL_L2_CH0_S  0
/** DMA2D_INFIFO_EMPTY_L2_CH0 : RO; bitpos: [1]; default: 1;
 *  Rx FIFO empty signal for Rx channel.
 */
#define DMA2D_INFIFO_EMPTY_L2_CH0    (BIT(1))
#define DMA2D_INFIFO_EMPTY_L2_CH0_M  (DMA2D_INFIFO_EMPTY_L2_CH0_V << DMA2D_INFIFO_EMPTY_L2_CH0_S)
#define DMA2D_INFIFO_EMPTY_L2_CH0_V  0x00000001U
#define DMA2D_INFIFO_EMPTY_L2_CH0_S  1
/** DMA2D_INFIFO_CNT_L2_CH0 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel.
 */
#define DMA2D_INFIFO_CNT_L2_CH0    0x0000000FU
#define DMA2D_INFIFO_CNT_L2_CH0_M  (DMA2D_INFIFO_CNT_L2_CH0_V << DMA2D_INFIFO_CNT_L2_CH0_S)
#define DMA2D_INFIFO_CNT_L2_CH0_V  0x0000000FU
#define DMA2D_INFIFO_CNT_L2_CH0_S  2
/** DMA2D_IN_REMAIN_UNDER_1B_CH0 : RO; bitpos: [7]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_1B_CH0    (BIT(7))
#define DMA2D_IN_REMAIN_UNDER_1B_CH0_M  (DMA2D_IN_REMAIN_UNDER_1B_CH0_V << DMA2D_IN_REMAIN_UNDER_1B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_1B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_1B_CH0_S  7
/** DMA2D_IN_REMAIN_UNDER_2B_CH0 : RO; bitpos: [8]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_2B_CH0    (BIT(8))
#define DMA2D_IN_REMAIN_UNDER_2B_CH0_M  (DMA2D_IN_REMAIN_UNDER_2B_CH0_V << DMA2D_IN_REMAIN_UNDER_2B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_2B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_2B_CH0_S  8
/** DMA2D_IN_REMAIN_UNDER_3B_CH0 : RO; bitpos: [9]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_3B_CH0    (BIT(9))
#define DMA2D_IN_REMAIN_UNDER_3B_CH0_M  (DMA2D_IN_REMAIN_UNDER_3B_CH0_V << DMA2D_IN_REMAIN_UNDER_3B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_3B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_3B_CH0_S  9
/** DMA2D_IN_REMAIN_UNDER_4B_CH0 : RO; bitpos: [10]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_4B_CH0    (BIT(10))
#define DMA2D_IN_REMAIN_UNDER_4B_CH0_M  (DMA2D_IN_REMAIN_UNDER_4B_CH0_V << DMA2D_IN_REMAIN_UNDER_4B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_4B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_4B_CH0_S  10
/** DMA2D_IN_REMAIN_UNDER_5B_CH0 : RO; bitpos: [11]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_5B_CH0    (BIT(11))
#define DMA2D_IN_REMAIN_UNDER_5B_CH0_M  (DMA2D_IN_REMAIN_UNDER_5B_CH0_V << DMA2D_IN_REMAIN_UNDER_5B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_5B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_5B_CH0_S  11
/** DMA2D_IN_REMAIN_UNDER_6B_CH0 : RO; bitpos: [12]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_6B_CH0    (BIT(12))
#define DMA2D_IN_REMAIN_UNDER_6B_CH0_M  (DMA2D_IN_REMAIN_UNDER_6B_CH0_V << DMA2D_IN_REMAIN_UNDER_6B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_6B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_6B_CH0_S  12
/** DMA2D_IN_REMAIN_UNDER_7B_CH0 : RO; bitpos: [13]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_7B_CH0    (BIT(13))
#define DMA2D_IN_REMAIN_UNDER_7B_CH0_M  (DMA2D_IN_REMAIN_UNDER_7B_CH0_V << DMA2D_IN_REMAIN_UNDER_7B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_7B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_7B_CH0_S  13
/** DMA2D_IN_REMAIN_UNDER_8B_CH0 : RO; bitpos: [14]; default: 0;
 *  reserved
 */
#define DMA2D_IN_REMAIN_UNDER_8B_CH0    (BIT(14))
#define DMA2D_IN_REMAIN_UNDER_8B_CH0_M  (DMA2D_IN_REMAIN_UNDER_8B_CH0_V << DMA2D_IN_REMAIN_UNDER_8B_CH0_S)
#define DMA2D_IN_REMAIN_UNDER_8B_CH0_V  0x00000001U
#define DMA2D_IN_REMAIN_UNDER_8B_CH0_S  14
/** DMA2D_INFIFO_FULL_L1_CH0 : RO; bitpos: [15]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_INFIFO_FULL_L1_CH0    (BIT(15))
#define DMA2D_INFIFO_FULL_L1_CH0_M  (DMA2D_INFIFO_FULL_L1_CH0_V << DMA2D_INFIFO_FULL_L1_CH0_S)
#define DMA2D_INFIFO_FULL_L1_CH0_V  0x00000001U
#define DMA2D_INFIFO_FULL_L1_CH0_S  15
/** DMA2D_INFIFO_EMPTY_L1_CH0 : RO; bitpos: [16]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_INFIFO_EMPTY_L1_CH0    (BIT(16))
#define DMA2D_INFIFO_EMPTY_L1_CH0_M  (DMA2D_INFIFO_EMPTY_L1_CH0_V << DMA2D_INFIFO_EMPTY_L1_CH0_S)
#define DMA2D_INFIFO_EMPTY_L1_CH0_V  0x00000001U
#define DMA2D_INFIFO_EMPTY_L1_CH0_S  16
/** DMA2D_INFIFO_CNT_L1_CH0 : RO; bitpos: [21:17]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_INFIFO_CNT_L1_CH0    0x0000001FU
#define DMA2D_INFIFO_CNT_L1_CH0_M  (DMA2D_INFIFO_CNT_L1_CH0_V << DMA2D_INFIFO_CNT_L1_CH0_S)
#define DMA2D_INFIFO_CNT_L1_CH0_V  0x0000001FU
#define DMA2D_INFIFO_CNT_L1_CH0_S  17
/** DMA2D_INFIFO_FULL_L3_CH0 : RO; bitpos: [22]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define DMA2D_INFIFO_FULL_L3_CH0    (BIT(22))
#define DMA2D_INFIFO_FULL_L3_CH0_M  (DMA2D_INFIFO_FULL_L3_CH0_V << DMA2D_INFIFO_FULL_L3_CH0_S)
#define DMA2D_INFIFO_FULL_L3_CH0_V  0x00000001U
#define DMA2D_INFIFO_FULL_L3_CH0_S  22
/** DMA2D_INFIFO_EMPTY_L3_CH0 : RO; bitpos: [23]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define DMA2D_INFIFO_EMPTY_L3_CH0    (BIT(23))
#define DMA2D_INFIFO_EMPTY_L3_CH0_M  (DMA2D_INFIFO_EMPTY_L3_CH0_V << DMA2D_INFIFO_EMPTY_L3_CH0_S)
#define DMA2D_INFIFO_EMPTY_L3_CH0_V  0x00000001U
#define DMA2D_INFIFO_EMPTY_L3_CH0_S  23
/** DMA2D_INFIFO_CNT_L3_CH0 : RO; bitpos: [28:24]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define DMA2D_INFIFO_CNT_L3_CH0    0x0000001FU
#define DMA2D_INFIFO_CNT_L3_CH0_M  (DMA2D_INFIFO_CNT_L3_CH0_V << DMA2D_INFIFO_CNT_L3_CH0_S)
#define DMA2D_INFIFO_CNT_L3_CH0_V  0x0000001FU
#define DMA2D_INFIFO_CNT_L3_CH0_S  24

/** DMA2D_IN_POP_CH0_REG register
 *  Configures the rx fifo of channel 0
 */
#define DMA2D_IN_POP_CH0_REG (DR_REG_DMA2D_BASE + 0x518)
/** DMA2D_INFIFO_RDATA_CH0 : RO; bitpos: [10:0]; default: 1024;
 *  This register stores the data popping from DMA Rx FIFO.
 */
#define DMA2D_INFIFO_RDATA_CH0    0x000007FFU
#define DMA2D_INFIFO_RDATA_CH0_M  (DMA2D_INFIFO_RDATA_CH0_V << DMA2D_INFIFO_RDATA_CH0_S)
#define DMA2D_INFIFO_RDATA_CH0_V  0x000007FFU
#define DMA2D_INFIFO_RDATA_CH0_S  0
/** DMA2D_INFIFO_POP_CH0 : R/W/SC; bitpos: [11]; default: 0;
 *  Set this bit to pop data from DMA Rx FIFO.
 */
#define DMA2D_INFIFO_POP_CH0    (BIT(11))
#define DMA2D_INFIFO_POP_CH0_M  (DMA2D_INFIFO_POP_CH0_V << DMA2D_INFIFO_POP_CH0_S)
#define DMA2D_INFIFO_POP_CH0_V  0x00000001U
#define DMA2D_INFIFO_POP_CH0_S  11

/** DMA2D_IN_LINK_CONF_CH0_REG register
 *  Configures the rx descriptor operations of channel 0
 */
#define DMA2D_IN_LINK_CONF_CH0_REG (DR_REG_DMA2D_BASE + 0x51c)
/** DMA2D_INLINK_AUTO_RET_CH0 : R/W; bitpos: [20]; default: 1;
 *  Configure the value of the owner field written back to the inlink descriptor.
 *  1: Write back 1. 0: Write back 0.
 */
#define DMA2D_INLINK_AUTO_RET_CH0    (BIT(20))
#define DMA2D_INLINK_AUTO_RET_CH0_M  (DMA2D_INLINK_AUTO_RET_CH0_V << DMA2D_INLINK_AUTO_RET_CH0_S)
#define DMA2D_INLINK_AUTO_RET_CH0_V  0x00000001U
#define DMA2D_INLINK_AUTO_RET_CH0_S  20
/** DMA2D_INLINK_STOP_CH0 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define DMA2D_INLINK_STOP_CH0    (BIT(21))
#define DMA2D_INLINK_STOP_CH0_M  (DMA2D_INLINK_STOP_CH0_V << DMA2D_INLINK_STOP_CH0_S)
#define DMA2D_INLINK_STOP_CH0_V  0x00000001U
#define DMA2D_INLINK_STOP_CH0_S  21
/** DMA2D_INLINK_START_CH0 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define DMA2D_INLINK_START_CH0    (BIT(22))
#define DMA2D_INLINK_START_CH0_M  (DMA2D_INLINK_START_CH0_V << DMA2D_INLINK_START_CH0_S)
#define DMA2D_INLINK_START_CH0_V  0x00000001U
#define DMA2D_INLINK_START_CH0_S  22
/** DMA2D_INLINK_RESTART_CH0 : R/W/SC; bitpos: [23]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define DMA2D_INLINK_RESTART_CH0    (BIT(23))
#define DMA2D_INLINK_RESTART_CH0_M  (DMA2D_INLINK_RESTART_CH0_V << DMA2D_INLINK_RESTART_CH0_S)
#define DMA2D_INLINK_RESTART_CH0_V  0x00000001U
#define DMA2D_INLINK_RESTART_CH0_S  23
/** DMA2D_INLINK_PARK_CH0 : RO; bitpos: [24]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define DMA2D_INLINK_PARK_CH0    (BIT(24))
#define DMA2D_INLINK_PARK_CH0_M  (DMA2D_INLINK_PARK_CH0_V << DMA2D_INLINK_PARK_CH0_S)
#define DMA2D_INLINK_PARK_CH0_V  0x00000001U
#define DMA2D_INLINK_PARK_CH0_S  24

/** DMA2D_IN_LINK_ADDR_CH0_REG register
 *  Configures the rx descriptor address of channel 0
 */
#define DMA2D_IN_LINK_ADDR_CH0_REG (DR_REG_DMA2D_BASE + 0x520)
/** DMA2D_INLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first inlink descriptor's address.
 */
#define DMA2D_INLINK_ADDR_CH0    0xFFFFFFFFU
#define DMA2D_INLINK_ADDR_CH0_M  (DMA2D_INLINK_ADDR_CH0_V << DMA2D_INLINK_ADDR_CH0_S)
#define DMA2D_INLINK_ADDR_CH0_V  0xFFFFFFFFU
#define DMA2D_INLINK_ADDR_CH0_S  0

/** DMA2D_IN_STATE_CH0_REG register
 *  Represents the working status of the rx descriptor of channel 0
 */
#define DMA2D_IN_STATE_CH0_REG (DR_REG_DMA2D_BASE + 0x524)
/** DMA2D_INLINK_DSCR_ADDR_CH0 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define DMA2D_INLINK_DSCR_ADDR_CH0    0x0003FFFFU
#define DMA2D_INLINK_DSCR_ADDR_CH0_M  (DMA2D_INLINK_DSCR_ADDR_CH0_V << DMA2D_INLINK_DSCR_ADDR_CH0_S)
#define DMA2D_INLINK_DSCR_ADDR_CH0_V  0x0003FFFFU
#define DMA2D_INLINK_DSCR_ADDR_CH0_S  0
/** DMA2D_IN_DSCR_STATE_CH0 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define DMA2D_IN_DSCR_STATE_CH0    0x00000003U
#define DMA2D_IN_DSCR_STATE_CH0_M  (DMA2D_IN_DSCR_STATE_CH0_V << DMA2D_IN_DSCR_STATE_CH0_S)
#define DMA2D_IN_DSCR_STATE_CH0_V  0x00000003U
#define DMA2D_IN_DSCR_STATE_CH0_S  18
/** DMA2D_IN_STATE_CH0 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define DMA2D_IN_STATE_CH0    0x00000007U
#define DMA2D_IN_STATE_CH0_M  (DMA2D_IN_STATE_CH0_V << DMA2D_IN_STATE_CH0_S)
#define DMA2D_IN_STATE_CH0_V  0x00000007U
#define DMA2D_IN_STATE_CH0_S  20
/** DMA2D_IN_RESET_AVAIL_CH0 : RO; bitpos: [23]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define DMA2D_IN_RESET_AVAIL_CH0    (BIT(23))
#define DMA2D_IN_RESET_AVAIL_CH0_M  (DMA2D_IN_RESET_AVAIL_CH0_V << DMA2D_IN_RESET_AVAIL_CH0_S)
#define DMA2D_IN_RESET_AVAIL_CH0_V  0x00000001U
#define DMA2D_IN_RESET_AVAIL_CH0_S  23

/** DMA2D_IN_SUC_EOF_DES_ADDR_CH0_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH0_REG (DR_REG_DMA2D_BASE + 0x528)
/** DMA2D_IN_SUC_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH0_M  (DMA2D_IN_SUC_EOF_DES_ADDR_CH0_V << DMA2D_IN_SUC_EOF_DES_ADDR_CH0_S)
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH0_S  0

/** DMA2D_IN_ERR_EOF_DES_ADDR_CH0_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH0_REG (DR_REG_DMA2D_BASE + 0x52c)
/** DMA2D_IN_ERR_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data.
 */
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH0_M  (DMA2D_IN_ERR_EOF_DES_ADDR_CH0_V << DMA2D_IN_ERR_EOF_DES_ADDR_CH0_S)
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH0_S  0

/** DMA2D_IN_DSCR_CH0_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_DSCR_CH0_REG (DR_REG_DMA2D_BASE + 0x530)
/** DMA2D_INLINK_DSCR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next inlink descriptor address x.
 */
#define DMA2D_INLINK_DSCR_CH0    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_CH0_M  (DMA2D_INLINK_DSCR_CH0_V << DMA2D_INLINK_DSCR_CH0_S)
#define DMA2D_INLINK_DSCR_CH0_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_CH0_S  0

/** DMA2D_IN_DSCR_BF0_CH0_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_DSCR_BF0_CH0_REG (DR_REG_DMA2D_BASE + 0x534)
/** DMA2D_INLINK_DSCR_BF0_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define DMA2D_INLINK_DSCR_BF0_CH0    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF0_CH0_M  (DMA2D_INLINK_DSCR_BF0_CH0_V << DMA2D_INLINK_DSCR_BF0_CH0_S)
#define DMA2D_INLINK_DSCR_BF0_CH0_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF0_CH0_S  0

/** DMA2D_IN_DSCR_BF1_CH0_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_DSCR_BF1_CH0_REG (DR_REG_DMA2D_BASE + 0x538)
/** DMA2D_INLINK_DSCR_BF1_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define DMA2D_INLINK_DSCR_BF1_CH0    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF1_CH0_M  (DMA2D_INLINK_DSCR_BF1_CH0_V << DMA2D_INLINK_DSCR_BF1_CH0_S)
#define DMA2D_INLINK_DSCR_BF1_CH0_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF1_CH0_S  0

/** DMA2D_IN_PERI_SEL_CH0_REG register
 *  Configures the rx peripheral of channel 0
 */
#define DMA2D_IN_PERI_SEL_CH0_REG (DR_REG_DMA2D_BASE + 0x53c)
/** DMA2D_IN_PERI_SEL_CH0 : R/W; bitpos: [2:0]; default: 7;
 *  This register is used to select peripheral for Rx channel   0:  jpeg     1:
 *  display-1     2: display-2        7: no choose
 */
#define DMA2D_IN_PERI_SEL_CH0    0x00000007U
#define DMA2D_IN_PERI_SEL_CH0_M  (DMA2D_IN_PERI_SEL_CH0_V << DMA2D_IN_PERI_SEL_CH0_S)
#define DMA2D_IN_PERI_SEL_CH0_V  0x00000007U
#define DMA2D_IN_PERI_SEL_CH0_S  0

/** DMA2D_IN_ARB_CH0_REG register
 *  Configures the rx arbiter of channel 0
 */
#define DMA2D_IN_ARB_CH0_REG (DR_REG_DMA2D_BASE + 0x540)
/** DMA2D_IN_ARB_TOKEN_NUM_CH0 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define DMA2D_IN_ARB_TOKEN_NUM_CH0    0x0000000FU
#define DMA2D_IN_ARB_TOKEN_NUM_CH0_M  (DMA2D_IN_ARB_TOKEN_NUM_CH0_V << DMA2D_IN_ARB_TOKEN_NUM_CH0_S)
#define DMA2D_IN_ARB_TOKEN_NUM_CH0_V  0x0000000FU
#define DMA2D_IN_ARB_TOKEN_NUM_CH0_S  0
/** DMA2D_IN_ARB_PRIORITY_CH0 : R/W; bitpos: [4]; default: 1;
 *  Set the priority of channel
 */
#define DMA2D_IN_ARB_PRIORITY_CH0    (BIT(4))
#define DMA2D_IN_ARB_PRIORITY_CH0_M  (DMA2D_IN_ARB_PRIORITY_CH0_V << DMA2D_IN_ARB_PRIORITY_CH0_S)
#define DMA2D_IN_ARB_PRIORITY_CH0_V  0x00000001U
#define DMA2D_IN_ARB_PRIORITY_CH0_S  4

/** DMA2D_IN_RO_STATUS_CH0_REG register
 *  Represents the status of the rx reorder module of channel 0
 */
#define DMA2D_IN_RO_STATUS_CH0_REG (DR_REG_DMA2D_BASE + 0x544)
/** DMA2D_INFIFO_RO_CNT_CH0 : RO; bitpos: [4:0]; default: 0;
 *  The register stores the byte number of the data in color convert Rx FIFO for
 *  channel 0.
 */
#define DMA2D_INFIFO_RO_CNT_CH0    0x0000001FU
#define DMA2D_INFIFO_RO_CNT_CH0_M  (DMA2D_INFIFO_RO_CNT_CH0_V << DMA2D_INFIFO_RO_CNT_CH0_S)
#define DMA2D_INFIFO_RO_CNT_CH0_V  0x0000001FU
#define DMA2D_INFIFO_RO_CNT_CH0_S  0
/** DMA2D_IN_RO_WR_STATE_CH0 : RO; bitpos: [6:5]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define DMA2D_IN_RO_WR_STATE_CH0    0x00000003U
#define DMA2D_IN_RO_WR_STATE_CH0_M  (DMA2D_IN_RO_WR_STATE_CH0_V << DMA2D_IN_RO_WR_STATE_CH0_S)
#define DMA2D_IN_RO_WR_STATE_CH0_V  0x00000003U
#define DMA2D_IN_RO_WR_STATE_CH0_S  5
/** DMA2D_IN_RO_RD_STATE_CH0 : RO; bitpos: [8:7]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define DMA2D_IN_RO_RD_STATE_CH0    0x00000003U
#define DMA2D_IN_RO_RD_STATE_CH0_M  (DMA2D_IN_RO_RD_STATE_CH0_V << DMA2D_IN_RO_RD_STATE_CH0_S)
#define DMA2D_IN_RO_RD_STATE_CH0_V  0x00000003U
#define DMA2D_IN_RO_RD_STATE_CH0_S  7
/** DMA2D_IN_PIXEL_BYTE_CH0 : RO; bitpos: [12:9]; default: 0;
 *  the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define DMA2D_IN_PIXEL_BYTE_CH0    0x0000000FU
#define DMA2D_IN_PIXEL_BYTE_CH0_M  (DMA2D_IN_PIXEL_BYTE_CH0_V << DMA2D_IN_PIXEL_BYTE_CH0_S)
#define DMA2D_IN_PIXEL_BYTE_CH0_V  0x0000000FU
#define DMA2D_IN_PIXEL_BYTE_CH0_S  9
/** DMA2D_IN_BURST_BLOCK_NUM_CH0 : RO; bitpos: [16:13]; default: 0;
 *  the number of macro blocks contained in a burst of data at RX channel
 */
#define DMA2D_IN_BURST_BLOCK_NUM_CH0    0x0000000FU
#define DMA2D_IN_BURST_BLOCK_NUM_CH0_M  (DMA2D_IN_BURST_BLOCK_NUM_CH0_V << DMA2D_IN_BURST_BLOCK_NUM_CH0_S)
#define DMA2D_IN_BURST_BLOCK_NUM_CH0_V  0x0000000FU
#define DMA2D_IN_BURST_BLOCK_NUM_CH0_S  13

