espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_IN_RO_PD_CONF_CH0_REG register
 *  Configures the rx reorder memory of channel 0
 */
#define DMA2D_IN_RO_PD_CONF_CH0_REG (DR_REG_DMA2D_BASE + 0x548)
/** DMA2D_IN_RO_RAM_FORCE_PD_CH0 : R/W; bitpos: [4]; default: 0;
 *  dma reorder ram power down
 */
#define DMA2D_IN_RO_RAM_FORCE_PD_CH0    (BIT(4))
#define DMA2D_IN_RO_RAM_FORCE_PD_CH0_M  (DMA2D_IN_RO_RAM_FORCE_PD_CH0_V << DMA2D_IN_RO_RAM_FORCE_PD_CH0_S)
#define DMA2D_IN_RO_RAM_FORCE_PD_CH0_V  0x00000001U
#define DMA2D_IN_RO_RAM_FORCE_PD_CH0_S  4
/** DMA2D_IN_RO_RAM_FORCE_PU_CH0 : R/W; bitpos: [5]; default: 1;
 *  dma reorder ram power up
 */
#define DMA2D_IN_RO_RAM_FORCE_PU_CH0    (BIT(5))
#define DMA2D_IN_RO_RAM_FORCE_PU_CH0_M  (DMA2D_IN_RO_RAM_FORCE_PU_CH0_V << DMA2D_IN_RO_RAM_FORCE_PU_CH0_S)
#define DMA2D_IN_RO_RAM_FORCE_PU_CH0_V  0x00000001U
#define DMA2D_IN_RO_RAM_FORCE_PU_CH0_S  5
/** DMA2D_IN_RO_RAM_CLK_FO_CH0 : R/W; bitpos: [6]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
 *  0: A gate-clock will be used when accessing the RAM in DMA.
 */
#define DMA2D_IN_RO_RAM_CLK_FO_CH0    (BIT(6))
#define DMA2D_IN_RO_RAM_CLK_FO_CH0_M  (DMA2D_IN_RO_RAM_CLK_FO_CH0_V << DMA2D_IN_RO_RAM_CLK_FO_CH0_S)
#define DMA2D_IN_RO_RAM_CLK_FO_CH0_V  0x00000001U
#define DMA2D_IN_RO_RAM_CLK_FO_CH0_S  6

/** DMA2D_IN_COLOR_CONVERT_CH0_REG register
 *  Configures the tx color convert of channel 0
 */
#define DMA2D_IN_COLOR_CONVERT_CH0_REG (DR_REG_DMA2D_BASE + 0x54c)
/** DMA2D_IN_COLOR_OUTPUT_SEL_CH0 : R/W; bitpos: [1:0]; default: 0;
 *  Set final color convert process and output type    0: RGB888 to RGB565     1:
 *  output directly
 */
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH0    0x00000003U
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH0_M  (DMA2D_IN_COLOR_OUTPUT_SEL_CH0_V << DMA2D_IN_COLOR_OUTPUT_SEL_CH0_S)
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH0_V  0x00000003U
#define DMA2D_IN_COLOR_OUTPUT_SEL_CH0_S  0
/** DMA2D_IN_COLOR_3B_PROC_EN_CH0 : R/W; bitpos: [2]; default: 0;
 *  Enable generic color convert module between color input & color output, need to
 *  configure parameter.
 */
#define DMA2D_IN_COLOR_3B_PROC_EN_CH0    (BIT(2))
#define DMA2D_IN_COLOR_3B_PROC_EN_CH0_M  (DMA2D_IN_COLOR_3B_PROC_EN_CH0_V << DMA2D_IN_COLOR_3B_PROC_EN_CH0_S)
#define DMA2D_IN_COLOR_3B_PROC_EN_CH0_V  0x00000001U
#define DMA2D_IN_COLOR_3B_PROC_EN_CH0_S  2
/** DMA2D_IN_COLOR_INPUT_SEL_CH0 : R/W; bitpos: [5:3]; default: 7;
 *  Set first color convert process and input color type    0: YUV422/420 to YUV444
 *  1: YUV422      2: YUV444/420      7: disable color space convert
 */
#define DMA2D_IN_COLOR_INPUT_SEL_CH0    0x00000007U
#define DMA2D_IN_COLOR_INPUT_SEL_CH0_M  (DMA2D_IN_COLOR_INPUT_SEL_CH0_V << DMA2D_IN_COLOR_INPUT_SEL_CH0_S)
#define DMA2D_IN_COLOR_INPUT_SEL_CH0_V  0x00000007U
#define DMA2D_IN_COLOR_INPUT_SEL_CH0_S  3

/** DMA2D_IN_SCRAMBLE_CH0_REG register
 *  Configures the rx scramble of channel 0
 */
#define DMA2D_IN_SCRAMBLE_CH0_REG (DR_REG_DMA2D_BASE + 0x550)
/** DMA2D_IN_SCRAMBLE_SEL_PRE_CH0 : R/W; bitpos: [2:0]; default: 0;
 *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
 *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH0    0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH0_M  (DMA2D_IN_SCRAMBLE_SEL_PRE_CH0_V << DMA2D_IN_SCRAMBLE_SEL_PRE_CH0_S)
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH0_V  0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_PRE_CH0_S  0
/** DMA2D_IN_SCRAMBLE_SEL_POST_CH0 : R/W; bitpos: [5:3]; default: 0;
 *  Scramble data after color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2
 *  3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
 */
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH0    0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH0_M  (DMA2D_IN_SCRAMBLE_SEL_POST_CH0_V << DMA2D_IN_SCRAMBLE_SEL_POST_CH0_S)
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH0_V  0x00000007U
#define DMA2D_IN_SCRAMBLE_SEL_POST_CH0_S  3

/** DMA2D_IN_COLOR_PARAM0_CH0_REG register
 *  Configures the rx color convert parameter of channel 0
 */
#define DMA2D_IN_COLOR_PARAM0_CH0_REG (DR_REG_DMA2D_BASE + 0x554)
/** DMA2D_IN_COLOR_PARAM_H0_CH0 : R/W; bitpos: [20:0]; default: 298;
 *  Set first 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_H0_CH0    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_H0_CH0_M  (DMA2D_IN_COLOR_PARAM_H0_CH0_V << DMA2D_IN_COLOR_PARAM_H0_CH0_S)
#define DMA2D_IN_COLOR_PARAM_H0_CH0_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_H0_CH0_S  0

/** DMA2D_IN_COLOR_PARAM1_CH0_REG register
 *  Configures the rx color convert parameter of channel 0
 */
#define DMA2D_IN_COLOR_PARAM1_CH0_REG (DR_REG_DMA2D_BASE + 0x558)
/** DMA2D_IN_COLOR_PARAM_H1_CH0 : R/W; bitpos: [27:0]; default: 210164121;
 *  Set last 2 parameter of most significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_H1_CH0    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_H1_CH0_M  (DMA2D_IN_COLOR_PARAM_H1_CH0_V << DMA2D_IN_COLOR_PARAM_H1_CH0_S)
#define DMA2D_IN_COLOR_PARAM_H1_CH0_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_H1_CH0_S  0

/** DMA2D_IN_COLOR_PARAM2_CH0_REG register
 *  Configures the rx color convert parameter of channel 0
 */
#define DMA2D_IN_COLOR_PARAM2_CH0_REG (DR_REG_DMA2D_BASE + 0x55c)
/** DMA2D_IN_COLOR_PARAM_M0_CH0 : R/W; bitpos: [20:0]; default: 1995050;
 *  Set first 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_M0_CH0    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_M0_CH0_M  (DMA2D_IN_COLOR_PARAM_M0_CH0_V << DMA2D_IN_COLOR_PARAM_M0_CH0_S)
#define DMA2D_IN_COLOR_PARAM_M0_CH0_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_M0_CH0_S  0

/** DMA2D_IN_COLOR_PARAM3_CH0_REG register
 *  Configures the rx color convert parameter of channel 0
 */
#define DMA2D_IN_COLOR_PARAM3_CH0_REG (DR_REG_DMA2D_BASE + 0x560)
/** DMA2D_IN_COLOR_PARAM_M1_CH0 : R/W; bitpos: [27:0]; default: 35540784;
 *  Set last 2 parameter of midium significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_M1_CH0    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_M1_CH0_M  (DMA2D_IN_COLOR_PARAM_M1_CH0_V << DMA2D_IN_COLOR_PARAM_M1_CH0_S)
#define DMA2D_IN_COLOR_PARAM_M1_CH0_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_M1_CH0_S  0

/** DMA2D_IN_COLOR_PARAM4_CH0_REG register
 *  Configures the rx color convert parameter of channel 0
 */
#define DMA2D_IN_COLOR_PARAM4_CH0_REG (DR_REG_DMA2D_BASE + 0x564)
/** DMA2D_IN_COLOR_PARAM_L0_CH0 : R/W; bitpos: [20:0]; default: 528682;
 *  Set first 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_L0_CH0    0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_L0_CH0_M  (DMA2D_IN_COLOR_PARAM_L0_CH0_V << DMA2D_IN_COLOR_PARAM_L0_CH0_S)
#define DMA2D_IN_COLOR_PARAM_L0_CH0_V  0x001FFFFFU
#define DMA2D_IN_COLOR_PARAM_L0_CH0_S  0

/** DMA2D_IN_COLOR_PARAM5_CH0_REG register
 *  Configures the rx color convert parameter of channel 0
 */
#define DMA2D_IN_COLOR_PARAM5_CH0_REG (DR_REG_DMA2D_BASE + 0x568)
/** DMA2D_IN_COLOR_PARAM_L1_CH0 : R/W; bitpos: [27:0]; default: 195899392;
 *  Set last 2 parameter of least significant byte of pending 3 bytes
 */
#define DMA2D_IN_COLOR_PARAM_L1_CH0    0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_L1_CH0_M  (DMA2D_IN_COLOR_PARAM_L1_CH0_V << DMA2D_IN_COLOR_PARAM_L1_CH0_S)
#define DMA2D_IN_COLOR_PARAM_L1_CH0_V  0x0FFFFFFFU
#define DMA2D_IN_COLOR_PARAM_L1_CH0_S  0

/** DMA2D_IN_ETM_CONF_CH0_REG register
 *  Configures the rx etm of channel 0
 */
#define DMA2D_IN_ETM_CONF_CH0_REG (DR_REG_DMA2D_BASE + 0x56c)
/** DMA2D_IN_ETM_EN_CH0 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_EN_CH0    (BIT(0))
#define DMA2D_IN_ETM_EN_CH0_M  (DMA2D_IN_ETM_EN_CH0_V << DMA2D_IN_ETM_EN_CH0_S)
#define DMA2D_IN_ETM_EN_CH0_V  0x00000001U
#define DMA2D_IN_ETM_EN_CH0_S  0
/** DMA2D_IN_ETM_LOOP_EN_CH0 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_LOOP_EN_CH0    (BIT(1))
#define DMA2D_IN_ETM_LOOP_EN_CH0_M  (DMA2D_IN_ETM_LOOP_EN_CH0_V << DMA2D_IN_ETM_LOOP_EN_CH0_S)
#define DMA2D_IN_ETM_LOOP_EN_CH0_V  0x00000001U
#define DMA2D_IN_ETM_LOOP_EN_CH0_S  1
/** DMA2D_IN_DSCR_TASK_MAK_CH0 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_IN_DSCR_TASK_MAK_CH0    0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH0_M  (DMA2D_IN_DSCR_TASK_MAK_CH0_V << DMA2D_IN_DSCR_TASK_MAK_CH0_S)
#define DMA2D_IN_DSCR_TASK_MAK_CH0_V  0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH0_S  2

/** DMA2D_IN_CONF0_CH1_REG register
 *  Configures the rx direction of channel 0
 */
#define DMA2D_IN_CONF0_CH1_REG (DR_REG_DMA2D_BASE + 0x600)
/** DMA2D_IN_MEM_TRANS_EN_CH1 : R/W; bitpos: [0]; default: 0;
 *  enable memory trans of the same channel
 */
#define DMA2D_IN_MEM_TRANS_EN_CH1    (BIT(0))
#define DMA2D_IN_MEM_TRANS_EN_CH1_M  (DMA2D_IN_MEM_TRANS_EN_CH1_V << DMA2D_IN_MEM_TRANS_EN_CH1_S)
#define DMA2D_IN_MEM_TRANS_EN_CH1_V  0x00000001U
#define DMA2D_IN_MEM_TRANS_EN_CH1_S  0
/** DMA2D_INDSCR_BURST_EN_CH1 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define DMA2D_INDSCR_BURST_EN_CH1    (BIT(2))
#define DMA2D_INDSCR_BURST_EN_CH1_M  (DMA2D_INDSCR_BURST_EN_CH1_V << DMA2D_INDSCR_BURST_EN_CH1_S)
#define DMA2D_INDSCR_BURST_EN_CH1_V  0x00000001U
#define DMA2D_INDSCR_BURST_EN_CH1_S  2
/** DMA2D_IN_ECC_AES_EN_CH1 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define DMA2D_IN_ECC_AES_EN_CH1    (BIT(3))
#define DMA2D_IN_ECC_AES_EN_CH1_M  (DMA2D_IN_ECC_AES_EN_CH1_V << DMA2D_IN_ECC_AES_EN_CH1_S)
#define DMA2D_IN_ECC_AES_EN_CH1_V  0x00000001U
#define DMA2D_IN_ECC_AES_EN_CH1_S  3
/** DMA2D_IN_CHECK_OWNER_CH1 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define DMA2D_IN_CHECK_OWNER_CH1    (BIT(4))
#define DMA2D_IN_CHECK_OWNER_CH1_M  (DMA2D_IN_CHECK_OWNER_CH1_V << DMA2D_IN_CHECK_OWNER_CH1_S)
#define DMA2D_IN_CHECK_OWNER_CH1_V  0x00000001U
#define DMA2D_IN_CHECK_OWNER_CH1_S  4
/** DMA2D_IN_LOOP_TEST_CH1 : R/W; bitpos: [5]; default: 0;
 *  reserved
 */
#define DMA2D_IN_LOOP_TEST_CH1    (BIT(5))
#define DMA2D_IN_LOOP_TEST_CH1_M  (DMA2D_IN_LOOP_TEST_CH1_V << DMA2D_IN_LOOP_TEST_CH1_S)
#define DMA2D_IN_LOOP_TEST_CH1_V  0x00000001U
#define DMA2D_IN_LOOP_TEST_CH1_S  5
/** DMA2D_IN_MEM_BURST_LENGTH_CH1 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 0. 0: 8 bytes      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define DMA2D_IN_MEM_BURST_LENGTH_CH1    0x00000007U
#define DMA2D_IN_MEM_BURST_LENGTH_CH1_M  (DMA2D_IN_MEM_BURST_LENGTH_CH1_V << DMA2D_IN_MEM_BURST_LENGTH_CH1_S)
#define DMA2D_IN_MEM_BURST_LENGTH_CH1_V  0x00000007U
#define DMA2D_IN_MEM_BURST_LENGTH_CH1_S  6
/** DMA2D_IN_MACRO_BLOCK_SIZE_CH1 : R/W; bitpos: [10:9]; default: 0;
 *  Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
 *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
 *  descriptor
 */
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH1    0x00000003U
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH1_M  (DMA2D_IN_MACRO_BLOCK_SIZE_CH1_V << DMA2D_IN_MACRO_BLOCK_SIZE_CH1_S)
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH1_V  0x00000003U
#define DMA2D_IN_MACRO_BLOCK_SIZE_CH1_S  9
/** DMA2D_IN_DSCR_PORT_EN_CH1 : R/W; bitpos: [11]; default: 0;
 *  Set this bit to 1 to obtain descriptor from IP port
 */
#define DMA2D_IN_DSCR_PORT_EN_CH1    (BIT(11))
#define DMA2D_IN_DSCR_PORT_EN_CH1_M  (DMA2D_IN_DSCR_PORT_EN_CH1_V << DMA2D_IN_DSCR_PORT_EN_CH1_S)
#define DMA2D_IN_DSCR_PORT_EN_CH1_V  0x00000001U
#define DMA2D_IN_DSCR_PORT_EN_CH1_S  11
/** DMA2D_IN_PAGE_BOUND_EN_CH1 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define DMA2D_IN_PAGE_BOUND_EN_CH1    (BIT(12))
#define DMA2D_IN_PAGE_BOUND_EN_CH1_M  (DMA2D_IN_PAGE_BOUND_EN_CH1_V << DMA2D_IN_PAGE_BOUND_EN_CH1_S)
#define DMA2D_IN_PAGE_BOUND_EN_CH1_V  0x00000001U
#define DMA2D_IN_PAGE_BOUND_EN_CH1_S  12
/** DMA2D_IN_REORDER_EN_CH1 : R/W; bitpos: [16]; default: 0;
 *  Enable RX channel 0 macro block reorder when set to 1, only channel0 have this
 *  selection
 */
#define DMA2D_IN_REORDER_EN_CH1    (BIT(16))
#define DMA2D_IN_REORDER_EN_CH1_M  (DMA2D_IN_REORDER_EN_CH1_V << DMA2D_IN_REORDER_EN_CH1_S)
#define DMA2D_IN_REORDER_EN_CH1_V  0x00000001U
#define DMA2D_IN_REORDER_EN_CH1_S  16
/** DMA2D_IN_RST_CH1 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define DMA2D_IN_RST_CH1    (BIT(24))
#define DMA2D_IN_RST_CH1_M  (DMA2D_IN_RST_CH1_V << DMA2D_IN_RST_CH1_S)
#define DMA2D_IN_RST_CH1_V  0x00000001U
#define DMA2D_IN_RST_CH1_S  24
/** DMA2D_IN_CMD_DISABLE_CH1 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define DMA2D_IN_CMD_DISABLE_CH1    (BIT(25))
#define DMA2D_IN_CMD_DISABLE_CH1_M  (DMA2D_IN_CMD_DISABLE_CH1_V << DMA2D_IN_CMD_DISABLE_CH1_S)
#define DMA2D_IN_CMD_DISABLE_CH1_V  0x00000001U
#define DMA2D_IN_CMD_DISABLE_CH1_S  25
/** DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1    (BIT(26))
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1_M  (DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1_V << DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1_S)
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1_V  0x00000001U
#define DMA2D_IN_ARB_WEIGHT_OPT_DIS_CH1_S  26

/** DMA2D_IN_INT_RAW_CH1_REG register
 *  Raw interrupt status of RX channel 0
 */
#define DMA2D_IN_INT_RAW_CH1_REG (DR_REG_DMA2D_BASE + 0x604)
/** DMA2D_IN_DONE_CH1_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 0.
 */
#define DMA2D_IN_DONE_CH1_INT_RAW    (BIT(0))
#define DMA2D_IN_DONE_CH1_INT_RAW_M  (DMA2D_IN_DONE_CH1_INT_RAW_V << DMA2D_IN_DONE_CH1_INT_RAW_S)
#define DMA2D_IN_DONE_CH1_INT_RAW_V  0x00000001U
#define DMA2D_IN_DONE_CH1_INT_RAW_S  0
/** DMA2D_IN_SUC_EOF_CH1_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 0.
 */
#define DMA2D_IN_SUC_EOF_CH1_INT_RAW    (BIT(1))
#define DMA2D_IN_SUC_EOF_CH1_INT_RAW_M  (DMA2D_IN_SUC_EOF_CH1_INT_RAW_V << DMA2D_IN_SUC_EOF_CH1_INT_RAW_S)
#define DMA2D_IN_SUC_EOF_CH1_INT_RAW_V  0x00000001U
#define DMA2D_IN_SUC_EOF_CH1_INT_RAW_S  1
/** DMA2D_IN_ERR_EOF_CH1_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and data error is detected
 */
#define DMA2D_IN_ERR_EOF_CH1_INT_RAW    (BIT(2))
#define DMA2D_IN_ERR_EOF_CH1_INT_RAW_M  (DMA2D_IN_ERR_EOF_CH1_INT_RAW_V << DMA2D_IN_ERR_EOF_CH1_INT_RAW_S)
#define DMA2D_IN_ERR_EOF_CH1_INT_RAW_V  0x00000001U
#define DMA2D_IN_ERR_EOF_CH1_INT_RAW_S  2
/** DMA2D_IN_DSCR_ERR_CH1_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor for Rx
 *  channel 0.
 */
#define DMA2D_IN_DSCR_ERR_CH1_INT_RAW    (BIT(3))
#define DMA2D_IN_DSCR_ERR_CH1_INT_RAW_M  (DMA2D_IN_DSCR_ERR_CH1_INT_RAW_V << DMA2D_IN_DSCR_ERR_CH1_INT_RAW_S)
#define DMA2D_IN_DSCR_ERR_CH1_INT_RAW_V  0x00000001U
#define DMA2D_IN_DSCR_ERR_CH1_INT_RAW_S  3
/** DMA2D_INFIFO_OVF_L1_CH1_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define DMA2D_INFIFO_OVF_L1_CH1_INT_RAW    (BIT(4))
#define DMA2D_INFIFO_OVF_L1_CH1_INT_RAW_M  (DMA2D_INFIFO_OVF_L1_CH1_INT_RAW_V << DMA2D_INFIFO_OVF_L1_CH1_INT_RAW_S)
#define DMA2D_INFIFO_OVF_L1_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_OVF_L1_CH1_INT_RAW_S  4
/** DMA2D_INFIFO_UDF_L1_CH1_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define DMA2D_INFIFO_UDF_L1_CH1_INT_RAW    (BIT(5))
#define DMA2D_INFIFO_UDF_L1_CH1_INT_RAW_M  (DMA2D_INFIFO_UDF_L1_CH1_INT_RAW_V << DMA2D_INFIFO_UDF_L1_CH1_INT_RAW_S)
#define DMA2D_INFIFO_UDF_L1_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_UDF_L1_CH1_INT_RAW_S  5
/** DMA2D_INFIFO_OVF_L2_CH1_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define DMA2D_INFIFO_OVF_L2_CH1_INT_RAW    (BIT(6))
#define DMA2D_INFIFO_OVF_L2_CH1_INT_RAW_M  (DMA2D_INFIFO_OVF_L2_CH1_INT_RAW_V << DMA2D_INFIFO_OVF_L2_CH1_INT_RAW_S)
#define DMA2D_INFIFO_OVF_L2_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_OVF_L2_CH1_INT_RAW_S  6
/** DMA2D_INFIFO_UDF_L2_CH1_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define DMA2D_INFIFO_UDF_L2_CH1_INT_RAW    (BIT(7))
#define DMA2D_INFIFO_UDF_L2_CH1_INT_RAW_M  (DMA2D_INFIFO_UDF_L2_CH1_INT_RAW_V << DMA2D_INFIFO_UDF_L2_CH1_INT_RAW_S)
#define DMA2D_INFIFO_UDF_L2_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_UDF_L2_CH1_INT_RAW_S  7
/** DMA2D_INFIFO_OVF_L3_CH1_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define DMA2D_INFIFO_OVF_L3_CH1_INT_RAW    (BIT(8))
#define DMA2D_INFIFO_OVF_L3_CH1_INT_RAW_M  (DMA2D_INFIFO_OVF_L3_CH1_INT_RAW_V << DMA2D_INFIFO_OVF_L3_CH1_INT_RAW_S)
#define DMA2D_INFIFO_OVF_L3_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_OVF_L3_CH1_INT_RAW_S  8
/** DMA2D_INFIFO_UDF_L3_CH1_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define DMA2D_INFIFO_UDF_L3_CH1_INT_RAW    (BIT(9))
#define DMA2D_INFIFO_UDF_L3_CH1_INT_RAW_M  (DMA2D_INFIFO_UDF_L3_CH1_INT_RAW_V << DMA2D_INFIFO_UDF_L3_CH1_INT_RAW_S)
#define DMA2D_INFIFO_UDF_L3_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_UDF_L3_CH1_INT_RAW_S  9
/** DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
 *  also remain data.
 */
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW    (BIT(10))
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW_M  (DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW_V << DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW_S)
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW_V  0x00000001U
#define DMA2D_IN_DSCR_EMPTY_CH1_INT_RAW_S  10
/** DMA2D_INFIFO_RO_OVF_CH1_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is overflow.
 */
#define DMA2D_INFIFO_RO_OVF_CH1_INT_RAW    (BIT(11))
#define DMA2D_INFIFO_RO_OVF_CH1_INT_RAW_M  (DMA2D_INFIFO_RO_OVF_CH1_INT_RAW_V << DMA2D_INFIFO_RO_OVF_CH1_INT_RAW_S)
#define DMA2D_INFIFO_RO_OVF_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_RO_OVF_CH1_INT_RAW_S  11
/** DMA2D_INFIFO_RO_UDF_CH1_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit turns to high level when reorder fifo is underflow.
 */
#define DMA2D_INFIFO_RO_UDF_CH1_INT_RAW    (BIT(12))
#define DMA2D_INFIFO_RO_UDF_CH1_INT_RAW_M  (DMA2D_INFIFO_RO_UDF_CH1_INT_RAW_V << DMA2D_INFIFO_RO_UDF_CH1_INT_RAW_S)
#define DMA2D_INFIFO_RO_UDF_CH1_INT_RAW_V  0x00000001U
#define DMA2D_INFIFO_RO_UDF_CH1_INT_RAW_S  12
/** DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW    (BIT(13))
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW_M  (DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW_V << DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW_S)
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW_V  0x00000001U
#define DMA2D_IN_DSCR_TASK_OVF_CH1_INT_RAW_S  13

