espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_reg.h
/** DMA2D_IN_LINK_ADDR_CH1_REG register
 *  Configures the rx descriptor address of channel 0
 */
#define DMA2D_IN_LINK_ADDR_CH1_REG (DR_REG_DMA2D_BASE + 0x620)
/** DMA2D_INLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first inlink descriptor's address.
 */
#define DMA2D_INLINK_ADDR_CH1    0xFFFFFFFFU
#define DMA2D_INLINK_ADDR_CH1_M  (DMA2D_INLINK_ADDR_CH1_V << DMA2D_INLINK_ADDR_CH1_S)
#define DMA2D_INLINK_ADDR_CH1_V  0xFFFFFFFFU
#define DMA2D_INLINK_ADDR_CH1_S  0

/** DMA2D_IN_STATE_CH1_REG register
 *  Represents the working status of the rx descriptor of channel 0
 */
#define DMA2D_IN_STATE_CH1_REG (DR_REG_DMA2D_BASE + 0x624)
/** DMA2D_INLINK_DSCR_ADDR_CH1 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define DMA2D_INLINK_DSCR_ADDR_CH1    0x0003FFFFU
#define DMA2D_INLINK_DSCR_ADDR_CH1_M  (DMA2D_INLINK_DSCR_ADDR_CH1_V << DMA2D_INLINK_DSCR_ADDR_CH1_S)
#define DMA2D_INLINK_DSCR_ADDR_CH1_V  0x0003FFFFU
#define DMA2D_INLINK_DSCR_ADDR_CH1_S  0
/** DMA2D_IN_DSCR_STATE_CH1 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define DMA2D_IN_DSCR_STATE_CH1    0x00000003U
#define DMA2D_IN_DSCR_STATE_CH1_M  (DMA2D_IN_DSCR_STATE_CH1_V << DMA2D_IN_DSCR_STATE_CH1_S)
#define DMA2D_IN_DSCR_STATE_CH1_V  0x00000003U
#define DMA2D_IN_DSCR_STATE_CH1_S  18
/** DMA2D_IN_STATE_CH1 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define DMA2D_IN_STATE_CH1    0x00000007U
#define DMA2D_IN_STATE_CH1_M  (DMA2D_IN_STATE_CH1_V << DMA2D_IN_STATE_CH1_S)
#define DMA2D_IN_STATE_CH1_V  0x00000007U
#define DMA2D_IN_STATE_CH1_S  20
/** DMA2D_IN_RESET_AVAIL_CH1 : RO; bitpos: [23]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define DMA2D_IN_RESET_AVAIL_CH1    (BIT(23))
#define DMA2D_IN_RESET_AVAIL_CH1_M  (DMA2D_IN_RESET_AVAIL_CH1_V << DMA2D_IN_RESET_AVAIL_CH1_S)
#define DMA2D_IN_RESET_AVAIL_CH1_V  0x00000001U
#define DMA2D_IN_RESET_AVAIL_CH1_S  23

/** DMA2D_IN_SUC_EOF_DES_ADDR_CH1_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH1_REG (DR_REG_DMA2D_BASE + 0x628)
/** DMA2D_IN_SUC_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH1_M  (DMA2D_IN_SUC_EOF_DES_ADDR_CH1_V << DMA2D_IN_SUC_EOF_DES_ADDR_CH1_S)
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define DMA2D_IN_SUC_EOF_DES_ADDR_CH1_S  0

/** DMA2D_IN_ERR_EOF_DES_ADDR_CH1_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH1_REG (DR_REG_DMA2D_BASE + 0x62c)
/** DMA2D_IN_ERR_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data.
 */
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH1_M  (DMA2D_IN_ERR_EOF_DES_ADDR_CH1_V << DMA2D_IN_ERR_EOF_DES_ADDR_CH1_S)
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define DMA2D_IN_ERR_EOF_DES_ADDR_CH1_S  0

/** DMA2D_IN_DSCR_CH1_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_DSCR_CH1_REG (DR_REG_DMA2D_BASE + 0x630)
/** DMA2D_INLINK_DSCR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next inlink descriptor address x.
 */
#define DMA2D_INLINK_DSCR_CH1    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_CH1_M  (DMA2D_INLINK_DSCR_CH1_V << DMA2D_INLINK_DSCR_CH1_S)
#define DMA2D_INLINK_DSCR_CH1_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_CH1_S  0

/** DMA2D_IN_DSCR_BF0_CH1_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_DSCR_BF0_CH1_REG (DR_REG_DMA2D_BASE + 0x634)
/** DMA2D_INLINK_DSCR_BF0_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define DMA2D_INLINK_DSCR_BF0_CH1    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF0_CH1_M  (DMA2D_INLINK_DSCR_BF0_CH1_V << DMA2D_INLINK_DSCR_BF0_CH1_S)
#define DMA2D_INLINK_DSCR_BF0_CH1_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF0_CH1_S  0

/** DMA2D_IN_DSCR_BF1_CH1_REG register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
#define DMA2D_IN_DSCR_BF1_CH1_REG (DR_REG_DMA2D_BASE + 0x638)
/** DMA2D_INLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define DMA2D_INLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF1_CH1_M  (DMA2D_INLINK_DSCR_BF1_CH1_V << DMA2D_INLINK_DSCR_BF1_CH1_S)
#define DMA2D_INLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define DMA2D_INLINK_DSCR_BF1_CH1_S  0

/** DMA2D_IN_PERI_SEL_CH1_REG register
 *  Configures the rx peripheral of channel 0
 */
#define DMA2D_IN_PERI_SEL_CH1_REG (DR_REG_DMA2D_BASE + 0x63c)
/** DMA2D_IN_PERI_SEL_CH1 : R/W; bitpos: [2:0]; default: 7;
 *  This register is used to select peripheral for Rx channel   0:  jpeg     1:
 *  display-1     2: display-2        7: no choose
 */
#define DMA2D_IN_PERI_SEL_CH1    0x00000007U
#define DMA2D_IN_PERI_SEL_CH1_M  (DMA2D_IN_PERI_SEL_CH1_V << DMA2D_IN_PERI_SEL_CH1_S)
#define DMA2D_IN_PERI_SEL_CH1_V  0x00000007U
#define DMA2D_IN_PERI_SEL_CH1_S  0

/** DMA2D_IN_ARB_CH1_REG register
 *  Configures the rx arbiter of channel 0
 */
#define DMA2D_IN_ARB_CH1_REG (DR_REG_DMA2D_BASE + 0x640)
/** DMA2D_IN_ARB_TOKEN_NUM_CH1 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define DMA2D_IN_ARB_TOKEN_NUM_CH1    0x0000000FU
#define DMA2D_IN_ARB_TOKEN_NUM_CH1_M  (DMA2D_IN_ARB_TOKEN_NUM_CH1_V << DMA2D_IN_ARB_TOKEN_NUM_CH1_S)
#define DMA2D_IN_ARB_TOKEN_NUM_CH1_V  0x0000000FU
#define DMA2D_IN_ARB_TOKEN_NUM_CH1_S  0
/** DMA2D_IN_ARB_PRIORITY_CH1 : R/W; bitpos: [4]; default: 1;
 *  Set the priority of channel
 */
#define DMA2D_IN_ARB_PRIORITY_CH1    (BIT(4))
#define DMA2D_IN_ARB_PRIORITY_CH1_M  (DMA2D_IN_ARB_PRIORITY_CH1_V << DMA2D_IN_ARB_PRIORITY_CH1_S)
#define DMA2D_IN_ARB_PRIORITY_CH1_V  0x00000001U
#define DMA2D_IN_ARB_PRIORITY_CH1_S  4

/** DMA2D_IN_RO_STATUS_CH1_REG register
 *  Represents the status of the rx reorder module of channel 0
 */
#define DMA2D_IN_RO_STATUS_CH1_REG (DR_REG_DMA2D_BASE + 0x644)
/** DMA2D_INFIFO_RO_CNT_CH1 : RO; bitpos: [4:0]; default: 0;
 *  The register stores the byte number of the data in color convert Rx FIFO for
 *  channel 0.
 */
#define DMA2D_INFIFO_RO_CNT_CH1    0x0000001FU
#define DMA2D_INFIFO_RO_CNT_CH1_M  (DMA2D_INFIFO_RO_CNT_CH1_V << DMA2D_INFIFO_RO_CNT_CH1_S)
#define DMA2D_INFIFO_RO_CNT_CH1_V  0x0000001FU
#define DMA2D_INFIFO_RO_CNT_CH1_S  0
/** DMA2D_IN_RO_WR_STATE_CH1 : RO; bitpos: [6:5]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define DMA2D_IN_RO_WR_STATE_CH1    0x00000003U
#define DMA2D_IN_RO_WR_STATE_CH1_M  (DMA2D_IN_RO_WR_STATE_CH1_V << DMA2D_IN_RO_WR_STATE_CH1_S)
#define DMA2D_IN_RO_WR_STATE_CH1_V  0x00000003U
#define DMA2D_IN_RO_WR_STATE_CH1_S  5
/** DMA2D_IN_RO_RD_STATE_CH1 : RO; bitpos: [8:7]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define DMA2D_IN_RO_RD_STATE_CH1    0x00000003U
#define DMA2D_IN_RO_RD_STATE_CH1_M  (DMA2D_IN_RO_RD_STATE_CH1_V << DMA2D_IN_RO_RD_STATE_CH1_S)
#define DMA2D_IN_RO_RD_STATE_CH1_V  0x00000003U
#define DMA2D_IN_RO_RD_STATE_CH1_S  7
/** DMA2D_IN_PIXEL_BYTE_CH1 : RO; bitpos: [12:9]; default: 0;
 *  the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define DMA2D_IN_PIXEL_BYTE_CH1    0x0000000FU
#define DMA2D_IN_PIXEL_BYTE_CH1_M  (DMA2D_IN_PIXEL_BYTE_CH1_V << DMA2D_IN_PIXEL_BYTE_CH1_S)
#define DMA2D_IN_PIXEL_BYTE_CH1_V  0x0000000FU
#define DMA2D_IN_PIXEL_BYTE_CH1_S  9
/** DMA2D_IN_BURST_BLOCK_NUM_CH1 : RO; bitpos: [16:13]; default: 0;
 *  the number of macro blocks contained in a burst of data at RX channel
 */
#define DMA2D_IN_BURST_BLOCK_NUM_CH1    0x0000000FU
#define DMA2D_IN_BURST_BLOCK_NUM_CH1_M  (DMA2D_IN_BURST_BLOCK_NUM_CH1_V << DMA2D_IN_BURST_BLOCK_NUM_CH1_S)
#define DMA2D_IN_BURST_BLOCK_NUM_CH1_V  0x0000000FU
#define DMA2D_IN_BURST_BLOCK_NUM_CH1_S  13

/** DMA2D_IN_ETM_CONF_CH1_REG register
 *  Configures the rx etm of channel 0
 */
#define DMA2D_IN_ETM_CONF_CH1_REG (DR_REG_DMA2D_BASE + 0x648)
/** DMA2D_IN_ETM_EN_CH1 : R/W; bitpos: [0]; default: 0;
 *  Configures the enable of the etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_EN_CH1    (BIT(0))
#define DMA2D_IN_ETM_EN_CH1_M  (DMA2D_IN_ETM_EN_CH1_V << DMA2D_IN_ETM_EN_CH1_S)
#define DMA2D_IN_ETM_EN_CH1_V  0x00000001U
#define DMA2D_IN_ETM_EN_CH1_S  0
/** DMA2D_IN_ETM_LOOP_EN_CH1 : R/W; bitpos: [1]; default: 0;
 *  Configures the enable of the descriptors loop etm function, 1 is enable.
 */
#define DMA2D_IN_ETM_LOOP_EN_CH1    (BIT(1))
#define DMA2D_IN_ETM_LOOP_EN_CH1_M  (DMA2D_IN_ETM_LOOP_EN_CH1_V << DMA2D_IN_ETM_LOOP_EN_CH1_S)
#define DMA2D_IN_ETM_LOOP_EN_CH1_V  0x00000001U
#define DMA2D_IN_ETM_LOOP_EN_CH1_S  1
/** DMA2D_IN_DSCR_TASK_MAK_CH1 : R/W; bitpos: [3:2]; default: 1;
 *  Configures the maximum number of cacheable descriptors.
 */
#define DMA2D_IN_DSCR_TASK_MAK_CH1    0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH1_M  (DMA2D_IN_DSCR_TASK_MAK_CH1_V << DMA2D_IN_DSCR_TASK_MAK_CH1_S)
#define DMA2D_IN_DSCR_TASK_MAK_CH1_V  0x00000003U
#define DMA2D_IN_DSCR_TASK_MAK_CH1_S  2

